dustinb/bitaxe-lights/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_WEBSOCKET=y